# The DataFrame Data Structure

In [2]:
import pandas as pd

In [3]:
purchase_1 = pd.Series({'Name':'Chris',
                       'Item Purchased':'Dog Food',
                       'Cost': 22.50})
purchase_2 = pd.Series({'Name':'Kevin',
                       'Item Purchased':'Kitty Litter',
                       'Cost': 2.50})
purchase_3 = pd.Series({'Name':'Chris',
                       'Item Purchased':'Bird Seed',
                       'Cost': 5.0})

In [4]:
purchase_1

Name                 Chris
Item Purchased    Dog Food
Cost                  22.5
dtype: object

In [5]:
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store1', 'Store1', 'Store2'])
df.head()

         Name Item Purchased  Cost
Store1  Chris       Dog Food  22.5
Store1  Kevin   Kitty Litter   2.5
Store2  Chris      Bird Seed   5.0

In [6]:
df.loc['Store2']

Name                  Chris
Item Purchased    Bird Seed
Cost                      5
Name: Store2, dtype: object

In [7]:
df.loc['Store1']

         Name Item Purchased  Cost
Store1  Chris       Dog Food  22.5
Store1  Kevin   Kitty Litter   2.5

In [8]:
df.loc['Store1']['Cost']

Store1    22.5
Store1     2.5
Name: Cost, dtype: float64

In [9]:
df.loc['Store1', 'Cost']

Store1    22.5
Store1     2.5
Name: Cost, dtype: float64

In [10]:
df.T

                  Store1        Store1     Store2
Name               Chris         Kevin      Chris
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [11]:
df.T.loc['Cost']

Store1    22.5
Store1     2.5
Store2       5
Name: Cost, dtype: object

In [12]:
df['Cost']

Store1    22.5
Store1     2.5
Store2     5.0
Name: Cost, dtype: float64

In [14]:
df.loc[:, ['Name', 'Cost']]
# SQL: select Name, Cost from df

         Name  Cost
Store1  Chris  22.5
Store1  Kevin   2.5
Store2  Chris   5.0

In [17]:
df.drop('Store1')         # 실제 df 자체 변화X

         Name Item Purchased  Cost
Store2  Chris      Bird Seed   5.0

In [18]:
df

         Name Item Purchased  Cost
Store1  Chris       Dog Food  22.5
Store1  Kevin   Kitty Litter   2.5
Store2  Chris      Bird Seed   5.0

In [19]:
copy_df = df.copy()

In [22]:
copy_df = df.drop('Store1')
copy_df

         Name Item Purchased  Cost
Store2  Chris      Bird Seed   5.0

In [23]:
del df['Name']

In [24]:
df

       Item Purchased  Cost
Store1       Dog Food  22.5
Store1   Kitty Litter   2.5
Store2      Bird Seed   5.0

In [25]:
df['Location'] = None
df

       Item Purchased  Cost Location
Store1       Dog Food  22.5     None
Store1   Kitty Litter   2.5     None
Store2      Bird Seed   5.0     None